import datetime
import time

import httpx
from tabulate import tabulate


def income(基金名称, N年年化, 交易流水):
    """
    基金名称:   新能源汽车
    N年年化:    [316.31, 3 * 12 * 30]
    交易流水:   [('2021-10-01', 10), ('2021-10-19', 200),]
    """
    天化, data = (1 + (N年年化[0] / 100.0)) ** (1 / (N年年化[1] * 1.0)) - 1, {}
    交易流水.sort(key=lambda x: x[0])
    总金额 = 总投入 = 0
    开始交易时间 = datetime.datetime.strptime(交易流水[0][0], '%Y-%m-%d')
    交易天数 = (datetime.datetime.now() - 开始交易时间).days
    for 第几天 in range(0, 交易天数 + 1):
        时间 = (开始交易时间 + datetime.timedelta(days=第几天)).strftime('%Y-%m-%d')
        交易流水_slice = [i[:2] for i in 交易流水]
        总投入 += dict(交易流水_slice).get(时间, 0)
        总金额 += 总金额 * 天化 + dict(交易流水_slice).get(时间, 0)
        # print(基金名称, 时间, 第几天, 总金额, 总投入)

    可售 = 总金额 * 1.0065
    期望收益 = 可售 - 总投入
    持有收益率 = 期望收益 / 总投入

    仓位 = f"{(总投入 * 10.0 / 7000):0.3f}"
    try:
        持有份额 = sum([i[2] for i in 交易流水])
    except:
        持有份额 = 0
    return {
        '时间': 时间,
        '总投入': 总投入,
        '可售': 可售,
        '期望收益': 期望收益,
        '持有收益率': 持有收益率,
        '仓位': 仓位,
        '基金名称': 基金名称,
        '持有份额': 持有份额,
    }


def get_funds_info(fund_code):
    headers = {
        'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/95.0.4638.69 Safari/537.36'
    }
    datetime.datetime.now().strftime('%Y-%m-%d')
    now = datetime.datetime.now()
    start_date = now - datetime.timedelta(days=7)
    start_date = start_date.strftime('%Y-%m-%d')
    end_date = now.strftime('%Y-%m-%d')
    url = f'http://jingzhi.funds.hexun.com/DataBase/jzzs.aspx?fundcode={fund_code}&startdate={start_date}&enddate={end_date}'
    try:
        r = httpx.get(url=url, headers=headers, timeout=40)
        content = str(r.content)
    except:
        content = ''
    content_split_list = content.split('<tr>')
    data = {}
    for content_split in content_split_list:
        if '2019-' not in content_split or '2020-' not in content_split or '2021-' not in content_split or '2022-' not in content_split:
            content
        if not ('class="f_green"' in content_split or 'class="f_red"' in content_split):
            continue
        td_split = content_split.split('</td>')
        date = td_split[0].split('>')[-1]
        if not date:
            continue
        value = td_split[1].split('>')[-1]
        rate = td_split[3].split('>')[-1]
        data[date] = {'value': value, 'rate': rate}
        if 'class="f_green"' in content_split:
            green_or_red = 'green'
        elif 'class="f_red"' in content_split:
            green_or_red = 'red'
        data[date] = {'value': value, 'rate': rate, 'green_or_red': green_or_red}

    date_sort = list(data.keys())
    date_sort.sort()
    try:
        before_value = data[date_sort[0]]['value']
    except:
        return {}
    for date in date_sort:
        data[date]['before_value'] = before_value
        before_value = data[date]['value']
    time.sleep(1)
    return data


data = {
    '工银瑞信文体产业股票A\033[0;30;41m[打算出售 146.76 份]\033[0m': {
        'N年年化': [212, 3 * 12 * 30, ],
        '交易流水': [
            ('2021-09-29', 490.41, 2.79), ('2021-09-06', 10, 143.98)
        ],
        '代码': '001714',
    },
    '诺安成长混合\033[0;30;41m[打算出售 1 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28),
        ],
        '代码': '320007',
    },
    '诺安成长混合\033[0;30;41m[打算出售 2 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
        ],
        '代码': '320007',
    },
    '诺安成长混合\033[0;30;41m[打算出售 3 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
            ('2021-09-16', 479.68, 234.32),
        ],
        '代码': '320007',
    },
    '诺安成长混合\033[0;30;41m[打算出售 4 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
            ('2021-09-16', 479.68, 234.32),
            ('2021-09-29', 482.49, 233.08),
        ],
        '代码': '320007',
    },
    '诺安成长混合\033[0;30;41m[打算出售 5 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
            ('2021-09-16', 479.68, 234.32),
            ('2021-09-29', 482.49, 233.08), ('2021-10-11', 520.49, 255.76),
        ],
        '代码': '320007',
    },
    '诺安成长混合\033[0;30;41m[打算出售 6 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
            ('2021-09-16', 479.68, 234.32),
            ('2021-09-29', 482.49, 233.08), ('2021-10-11', 520.49, 255.76), ('2021-10-12', 539.0, 273.89),
        ],
        '代码': '320007',
    },
    '诺安成长混合\033[0;30;41m[打算出售 7 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
            ('2021-09-16', 479.68, 234.32),
            ('2021-09-29', 482.49, 233.08), ('2021-10-11', 520.49, 255.76), ('2021-10-12', 539.0, 273.89),
            ('2021-10-18', 434.94, 215.74),
        ],
        '代码': '320007',
    },
    '诺安成长混合\033[0;30;41m[打算出售 8 份]\033[0m': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
            ('2021-09-16', 479.68, 234.32),
            ('2021-09-29', 482.49, 233.08), ('2021-10-11', 520.49, 255.76), ('2021-10-12', 539.0, 273.89),
            ('2021-10-18', 434.94, 215.74),
            ('2021-10-20', 79.79, 39.78),
        ],
        '代码': '320007',
    },
    '诺安成长混合': {
        'N年年化': [229, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-06', 10, 4.09), ('2021-08-10', 990.23, 421.28), ('2021-08-28', 139.09, 62.59),
            ('2021-09-16', 479.68, 234.32),
            ('2021-09-29', 482.49, 233.08), ('2021-10-11', 520.49, 255.76), ('2021-10-12', 539.0, 273.89),
            ('2021-10-18', 434.94, 215.74),
            ('2021-10-20', 79.79, 39.78),
            ('2021-10-27', 586.66, 244.01 + 42.29),
        ],
        '代码': '320007',
    },
    '白酒': {
        'N年年化': [268, 3 * 12 * 30],
        '交易流水': [
            ('2021-01-25', 10, 0), ('2021-09-22', 439.34, 0), ('2021-10-18', 812.8, 0), ('2021-10-27', 665.01, 1503.48),
            ('2021-11-02', 734.50, 571.56), ('2021-11-09', 118.06, 89.94),
        ],
        '代码': '161725',
        '恒定市值区间': [1.1255, 1.6466 - (1.6466 - 1.1255) * 0.4437],
    },
    '中欧医疗A': {
        'N年年化': [203, 3 * 12 * 30],
        '交易流水': [
            ('2021-08-05', 10, 0), ('2021-08-08', 490.29 + 500, 0), ('2021-08-11', -33.03, 0), ('2021-08-28', 249.5, 0),
            ('2021-09-29', 274.29, 0),
            ('2021-10-20', 473.17, 0), ('2021-10-14', 500.0, 0),
            ('2021-10-11', 511.6, 0), ('2021-10-18', 569.48, 0), ('2021-10-26', 543.6, 0),
            ('2021-10-27', 543.96, 1326.06),
            ('2021-11-01', 976.81, 298.18),
            ('2021-11-04', 500, 157.05),
            ('2021-11-08', 700, 224.74,),
        ],
        '代码': '003095',
        '恒定市值区间': [3.0640, 4.3100 - (4.3100 - 3.0640) * 0.261],
    },
    '国泰半导体C[持有市值错误]': {
        'N年年化': [229, 3 * 12 * 30, ],
        '交易流水': [
            ('2021-11-03', 700, 359.75,),
            ('2021-11-08', 700, 359.58,),
            ('2021-11-02', 300, 146.77,),
        ],
        '代码': '008282',
    },
    '消费行业混合': {
        'N年年化': [171, 3 * 12 * 30],
        '交易流水': [
            ('2021-09-22', 559.07, 0),
            ('2021-08-08', 990.21, 0),
            ('2021-07-29', 10.0, 201.2)],
        '代码': '000083',
    },
    '易方达蓝筹精选': {
        'N年年化': [159, 3 * 12 * 30],
        '交易流水': [
            ('2021-10-27', 500, 185.39 + 3.71), ('2021-11-02', 701.63, 271.19), ('2021-11-09', 198.37, 76.66),
        ],
        '代码': '005827',
    },
    '工银瑞新新能源汽车': {
        '交易流水': [
            ('2021-10-23', 10, 2.18),
        ],
        'N年年化': [362, 3 * 12 * 30],
        '代码': '005940',
    },
    '农银汇理工业': {
        '交易流水': [
            ('2021-11-05', 10, 1.93, 0),
        ],
        'N年年化': [431, 3 * 12 * 30],
        '代码': '001606',
    },
    '工银瑞信文体产业股票A[定投1000]': {
        'N年年化': [212, 3 * 12 * 30, ],
        '交易流水': [
            ('2021-10-20', 484.84, 0), ('2021-09-29', 490.41, 0), ('2021-09-06', 10, 285.6)
        ],
        '代码': '001714',
    },
    '互联网[持有市值错误]': {
        'N年年化': [431, 3 * 12 * 30, ],
        '交易流水': [
            ('2021-09-25', 1006.52, 0), ('2021-09-23', 514.86, 0), ('2021-08-21', 10, 0), ('2021-09-03', 500, 1819.38),
        ],
        '代码': '006327',
    },
    '建信500': {
        'N年年化': [88.85, 3 * 12 * 30, ],
        '交易流水': [
            ('2021-09-29', 501.05, 0), ('2021-09-26', 490.12, 0), ('2021-09-19', 10.0, 320.90)
        ],
        '代码': '000478',
    },
    '广发睿毅领先混合A': {
        'N年年化': [185.71, 3 * 12 * 30, ],
        '交易流水': [
            ('2021-10-20', 489.94, 0), ('2021-09-06', 10.0, 191.58)
        ],
        '代码': '005233',
    },
}

tabular_data, headers = [], ['时间', ' 投入金额/持有市值/恒定市值/期望市值', '       持有收益/期望收益', '          期望收益率', '            持有仓位',
                             '             基金名称', ]
headers_strip = [h.strip() for h in headers]
for 基金名称 in data:
    result = income(基金名称, data[基金名称]['N年年化'], data[基金名称]['交易流水'], )

    funds_info = get_funds_info(data[基金名称]['代码'])

    if funds_info:
        value = float(funds_info[max(funds_info.keys())]['value'])
        持有市值 = float(f"{value * result['持有份额']:0.02f}")
    else:
        持有市值 = value = 0

    持有收益 = value * result['持有份额'] - result['总投入']
    持有收益率 = f"{result['持有收益率'] * 100:0.2f}%"

    恒定市值区间 = data[基金名称].get('恒定市值区间')
    if 恒定市值区间 and value:
        if 恒定市值区间[0] <= value <= 恒定市值区间[1]:
            恒定市值区间差 = (恒定市值区间[1] - 恒定市值区间[0]) / 10.0
            恒定市值 = (10 - (value - 恒定市值区间[0]) / 恒定市值区间差) * 7000 / 10
    else:
        恒定市值 = 0

    if 持有市值 > result['可售']:
        持有市值 = f'\033[0;30;41m{持有市值}\033[0m'
    else:
        持有市值 = f'\033[0;30;42m{持有市值}\033[0m'

    t_data = [result['时间'], f"{result['总投入']:0.02f}/{持有市值}/{恒定市值:0.02f}/{result['可售']:0.2f}",
              f"{持有收益:0.2f}/{result['期望收益']:0.2f}",
              持有收益率, result['仓位'],
              result['基金名称'], ]
    tabular_data.append(t_data)

print(tabulate(tabular_data=tabular_data, headers=headers, numalign='left'))
