import datetime

from django.core.management.base import BaseCommand
from tabulate import tabulate

from fund.models import Fund, FundValue, FundExpense, FundHoldings


class Command(BaseCommand):
    def handle(self, *_, **options):
        data = {
            "[白酒]招商中证白酒指数C": {  # 上涨中
                '三年年化': 268,
                '交易流水': [
                    ('2021-12-10', 500, '2022-01-06'),

                    ('2021-12-29', 500,),
                    # ('2021-12-29', 469.96,),
                    # {'交易日期': '2021-12-29', '交易金额': 469.96, "交易类型": '出售', }
                    # ('2021-12-29', 30.04,),
                ],
                "交易规则": '大于7天：0%',
                "高抛低吸": True,
            },
            "[半导体]华夏国证半导体芯片ETF联接C": {  # 上涨中
                '三年年化': 300,
                "交易规则": '大于7天：0%',
                "高抛低吸": True,
                '交易流水': [
                    ('2021-11-26', 260),
                    ('2021-12-06', 260),
                    ('2021-12-07', 500),
                    ('2021-12-10', 500),
                    # ('2021-12-17', 500),
                ],
            },
            "[医疗]工银前沿医疗股票C": {  # 上涨中
                '三年年化': 209,
                "交易规则": '大于30天: 0%',
                "高抛低吸": True,
                '交易流水': [
                    ('2021-11-30', 200),
                    ('2021-12-01', 200),
                    ('2021-12-02', 500.0),
                    ('2021-12-10', 500.0),
                    ('2021-12-15', 1000,),
                    ('2021-12-31', 200,),
                ],
            },
            "[军工]鹏华空天军工指数(LOF)C": {  # 下跌中
                '交易流水': [
                ],
                '三年年化': 188,
                "交易规则": '大于7天：0%',
                "高抛低吸": True,
            },
            "[新能源]工银瑞信新能源汽车主题混合C": {  # 下跌中
                '三年年化': 337,
                "交易规则": '大于30天: 0%',
                "高抛低吸": True,
                '交易流水': [
                    ('2021-10-23', 10.0, '2022-01-25'),
                    ('2021-11-24', 130.0, '2022-01-25'),
                    ('2021-11-25', 130.0, '2022-01-25'),
                    ('2021-11-30', 200.0, '2022-01-25'),
                    ('2021-12-17', 500.0),
                    ('2021-12-20', 735),
                    # ('2021-12-24', 400 - 239.64),
                    ('2021-12-24', 160.36),  # todo 出售
                ],
            },
            ########################### 高抛低吸分割线 ###########################

            '[白酒]招商中证白酒指数(LOF)A': {
                '三年年化': 294,
                '交易流水': [
                    ('2021-12-10', 500,),
                    ('2021-12-15', 500,),
                    ('2021-12-16', 1000,),
                    ('2021-12-17', 1000,),
                    ('2021-12-29', 165.2,),
                ],
                "交易规则": '大于7天：0.5%',
            },
            '[半导体]诺安成长混合': {
                '三年年化': 300,
                '交易流水': [
                    ('2021-08-06', 10.0),
                    ('2021-08-10', 990.23),
                    ('2021-08-30', 139.09),
                    ('2021-09-16', 479.68),
                    ('2021-09-29', 482.49),
                    ('2021-10-11', 520.49),
                    ('2021-10-12', 539.0),
                    ('2021-10-18', 434.94),
                    ('2021-10-20', 79.79),
                    ('2021-12-07', 500),
                    ('2021-12-20', 173),
                ],
                "交易规则": '大于7天：0.5%',
            },
            '[半导体]国泰半导体C': {
                '三年年化': 300,
                '交易流水':
                    [('2021-11-03', 700.0), ('2021-11-08', 700.0), ('2021-11-12', 300.0), ]
                ,
                "交易规则": '大于30天：0%',
            },
            "[半导体]银河创新成长混合A": {
                '三年年化': 275,
                "交易规则": '大于30天：0.5%',
                '交易流水': [
                    ('2021-12-24', 500),
                    ('2021-12-29', 510.22),
                ],
            },
            "[半导体]银河创新成长混合C": {
                '三年年化': 275,
                "交易规则": '大于7天：0%',
                '交易流水': [
                    ('2021-12-29', 500),
                ],
            },
            "[医疗]中欧医疗C": {
                '三年年化': 209,
                "交易规则": '大于30天: 0.5%',
                '交易流水': [
                    ('2021-11-18', 260.0),
                    ('2021-12-02', 260.0),
                ],
            },
            "[医疗]中欧医疗A": {
                '交易流水': [
                    ('2021-08-05', 10.0), ('2021-08-08', 990.29), ('2021-08-11', -33.03), ('2021-08-28', 249.5),
                    ('2021-09-29', 274.29), ('2021-10-20', 473.17), ('2021-10-14', 500.0), ('2021-10-11', 511.6),
                    ('2021-10-18', 569.48), ('2021-10-26', 543.6), ('2021-10-27', 543.96), ('2021-11-01', 976.81),
                    ('2021-11-04', 500.0), ('2021-11-08', 700.0), ('2021-11-12', 486.42), ('2021-12-02', 560),
                    ('2021-12-06', 650),
                    ('2021-12-10', 500),
                    ('2021-12-13', 500),
                    ('2021-12-15', 1000,),
                    ('2021-12-17', 626,),
                    ('2021-12-20', 899,),
                ],
                '三年年化': 209,
                "交易规则": '大于30天: 0.5%',
            },
            '[新能源]农银工业4.0混合': {
                '三年年化': 431,
                '交易流水': [
                    ('2021-11-05', 10.0), ('2021-11-25', 120.0),
                    ('2021-12-24', 374.68),
                ],
                "交易规则": '大于30天: 0.5%',
            },
            "[军工]易方达国防军工混合": {
                '交易流水': [
                    # ('2021-10-23', 10),
                    ('2021-11-23', 130, '2022-01-20'),

                    # ('2021-12-20', 272),
                    # ('2021-12-20', 126.14),
                    ('2021-12-20', 145.86),
                ],
                '三年年化': 188,
                "交易规则": '大于30天: 0.5%',
            },
        }
        FundHoldings.objects.all().delete()
        for fund_name in data:
            fund = Fund.objects.get(name=fund_name)
            FundExpense.objects.filter(fund=fund).delete()
            fund.three_yearly_change = data[fund_name]['三年年化']
            fund.transaction_rule = data[fund_name]['交易规则']
            fund.high_sale_low_buy = data[fund_name].get('高抛低吸', False)
            fund.save()
            交易流水 = data[fund_name]['交易流水']
            for detail in 交易流水:
                fund_value = FundValue.objects.get(fund=fund, deal_at=detail[0])
                hold = FundExpense.get_hold(fund_value=fund_value.value, expense=detail[1], fee=fund.fee)
                defaults = {'expense': detail[1], 'hold': hold, }
                if len(detail) > 2:
                    defaults['sale_using_date'] = detail[2]
                FundExpense.objects.update_or_create(fund=fund, deal_at=detail[0], defaults=defaults)

                # 仓位统计
                catetory_name = fund_name.split(']')[0].replace('[', '')
                fundholdings = FundHoldings.objects.get_or_create(catetory_name=catetory_name)[0]
                fundholdings.expense += detail[1]
                fundholdings.save()

        # 输出结果
        tabular_data, headers = [], ['持有份数', '  投入金额/持有市值/期望市值', '      持有收益/期望收益', '         持有收益率/期望收益率',
                                     '             基金名称', ]
        for 基金名称 in data:
            if not data[基金名称].get('高抛低吸', False):
                continue
            if not data[基金名称]['交易流水']:
                continue
            fund = Fund.objects.get(name=基金名称)
            持有市值 = 投入金额 = 期望市值 = 持有份数 = 0
            last_fundvalue = FundValue.objects.filter(fund=fund).exclude(
                deal_at=datetime.datetime.now().date()).order_by(
                'deal_at').last()
            for fund_expense in FundExpense.objects.filter(fund=fund, expense_type='buy'):
                持有市值 += fund_expense.hold * last_fundvalue.value
                持有份数 += fund_expense.hold
                投入金额 += fund_expense.expense
                期望市值 += fund_expense.hope_value
            持有市值 = round(持有市值, 2)
            持有收益 = 持有市值 - 投入金额
            期望收益 = 期望市值 - 投入金额
            持有收益率 = 持有收益 / 投入金额 if 投入金额 > 0 else 0
            期望收益率 = 期望收益 / 投入金额 if 投入金额 > 0 else 0

            if 持有市值 > 期望市值:
                持有市值 = f'\033[0;30;41m{持有市值}\033[0m'
            else:
                持有市值 = f'\033[0;30;42m{持有市值}\033[0m'

            t_data = [
                持有份数,
                f"{投入金额}/{持有市值}/{期望市值:0.02f}",
                f"{持有收益:0.2f}/{期望收益:0.02f}",
                f"{(持有收益率 * 100):0.02f}%/{(期望收益率 * 100):0.02f}%",
                基金名称,
            ]
            tabular_data.append(t_data)

        print(tabulate(tabular_data=tabular_data, headers=headers, numalign='left'))
